backend/docs/k6/results/read-heavy-without-l2.txt

3rd/backend on  new-try-to-k6 via 🅶 v8.14.3 via ☕ v21.0.9 via 🅺 took 1m44s
 15:09:30  ❯ time k6 run docs/k6/scenario.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: docs/k6/scenario.js
        output: -

     scenarios: (100.00%) 5 scenarios, 9 max VUs, 3m50s max duration (incl. graceful stop):
              * crud_and_import: 2 iterations for each of 5 VUs (maxDuration: 2m0s, exec: crudAndImport, gracefulStop: 30s)
              * conflict_update_delete: 10 iterations for each of 1 VUs (maxDuration: 2m0s, exec: concurrentUpdateDelete, startTime: 5s, gracefulStop: 30s)
              * conflict_delete_delete: 10 iterations for each of 1 VUs (maxDuration: 2m0s, exec: concurrentDeleteDelete, startTime: 10s, gracefulStop: 30s)
              * unique_name_race: 10 iterations for each of 1 VUs (maxDuration: 2m0s, exec: uniqueCreateRace, startTime: 15s, gracefulStop: 30s)
              * read_heavy: 1000 iterations for each of 1 VUs (maxDuration: 3m0s, exec: readOnly, startTime: 20s, gracefulStop: 30s)



  █ TOTAL RESULTS

    checks_total.......: 519     2.581701/s
    checks_succeeded...: 100.00% 519 out of 519
    checks_failed......: 0.00%   0 out of 519

    ✓ POST /persons -> 200
    ✓ PUT /persons/{id} -> 200
    ✓ DELETE /persons/{id} -> 200
    ✓ POST /persons/import -> 200
    ✓ POST /location/import -> 200
    ✓ concurrent PUT -> 200/404/409
    ✓ concurrent DELETE -> 200/404
    ✓ after delete person is gone (404)
    ✓ one delete wins, one gets 404
    ✓ exactly one create succeeds
    ✓ cleanup delete -> 200
    ✓ name is available after cleanup
    ✓ GET /persons -> 200

    HTTP
    http_req_duration..............: avg=380.66ms min=18.58ms med=140.18ms max=1.18s p(90)=942.14ms p(95)=977.36ms
      { expected_response:true }...: avg=400.33ms min=18.58ms med=148.8ms  max=1.18s p(90)=944.38ms p(95)=980.55ms
    http_req_failed................: 7.22%  39 out of 540
    http_reqs......................: 540    2.686163/s

    EXECUTION
    dropped_iterations.............: 621    3.089087/s
    iteration_duration.............: avg=485.45ms min=50.1ms  med=307.69ms max=1.57s p(90)=972.31ms p(95)=1s
    iterations.....................: 419    2.084263/s
    vus............................: 1      min=0         max=5
    vus_max........................: 9      min=9         max=9

    NETWORK
    data_received..................: 1.3 MB 6.3 kB/s
    data_sent......................: 121 kB 603 B/s



running (3m21.0s), 0/9 VUs, 419 complete and 0 interrupted iterations
crud_and_import        ✓ [ 100% ] 5 VUs  0m02.6s/2m0s  10/10 iters, 2 per VU
conflict_update_delete ✓ [ 100% ] 1 VUs  0m03.4s/2m0s  10/10 iters, 10 per VU
conflict_delete_delete ✓ [ 100% ] 1 VUs  0m03.1s/2m0s  10/10 iters, 10 per VU
unique_name_race       ✓ [ 100% ] 1 VUs  0m03.6s/2m0s  10/10 iters, 10 per VU
read_heavy             ✓ [ 100% ] 1 VUs  3m0s          0379/1000 iters, 1000 per VU

________________________________________________________
Executed in  201.40 secs      fish           external
   usr time  633.19 millis    0.22 millis  632.97 millis
   sys time  617.08 millis    1.53 millis  615.55 millis